{
  "presiden indonesia": "Presiden Indonesia saat ini adalah Joko Widodo.",
  "ibukota indonesia": "Ibukota Indonesia adalah Jakarta.",
  "gravitasi": "Gravitasi adalah gaya tarik yang membuat benda-benda saling tertarik.",
  "fotosintesis": "Fotosintesis adalah proses tanaman mengubah cahaya matahari jadi energi.",
  "komputer": "Komputer adalah alat elektronik yang bisa memproses data dan menjalankan program.",
  "halo": "Halo juga, Akiro! Ada yang bisa aku bantu hari ini?",
  "hai": "Halo juga, Akiro! Ada yang bisa aku bantu hari ini?",
  "terima kasih": "Sama-sama, Akiro! Senang bisa membantu.",
  "makasih": "Sama-sama, Akiro! Senang bisa membantu.",
  "fika bisa apa": "Fika bisa membantu kamu:\n- Menjawab pertanyaan umum (presiden, ibukota, komputer, dll)\n- Menghitung faktorial (contoh: 5!)\n- Menghitung ekspresi matematika (contoh: 2+3*4)\n- Memberi fakta teknologi\n- Menampilkan cuaca simulasi\n- Kalkulator dan geometri (keliling, luas, volume)\n- Menyimpan dan menampilkan riwayat tanya jawab\nCoba saja tanya atau gunakan menu yang tersedia!",
  "kamu bisa apa": "Aku bisa membantu kamu:\n- Menjawab pertanyaan umum\n- Kalkulator & geometri\n- Fakta teknologi\n- Cuaca simulasi\n- Menyimpan riwayat tanya jawab\nSilakan pilih menu atau tanya langsung!",
  "fakta teknologi": "Fakta teknologi hari ini:",
  "spek vivo v21 5g": "Ini spesifikasinya ya!\n- SoC: MediaTek Dimensity 800U\n- CPU: 2x Cortex-A76 2.4GHz + 6x Cortex-A55 2.0GHz\n- GPU: Mali-G57 MC3\n- RAM: 8GB LPDDR4x\n- ROM: 128GB UFS 2.2\n- Layar: AMOLED FHD+ 6.44 inci 90Hz\n- Baterai: 4000mAh, Fast Charging 33W\n- Kamera: Belakang 64MP + 8MP + 2MP, Depan 44MP\n- OS: Android 11, Funtouch OS 11.1\n- Jaringan: 5G, Wi-Fi 802.11 a/b/g/n/ac, Bluetooth 5.1\n- Dimensi: 159.7 x 73.2 x 7.29 mm\n- Berat: 176 gram\n- Warna: Sunset Dazzle, Dusk Blue, Moonlight Sonata\n",
  "spek samsung galaxy s21": "Ini spesifikasinya ya!\n- SoC: Exynos 2100 / Snapdragon 888\n- CPU: 1x Cortex-X1 2.9GHz + 3x Cortex-A78 2.80GHz + 4x Cortex-A55 2.20GHz\n- GPU: Mali-G78 MP14 / Adreno 660\n- RAM: 8GB LPDDR5\n- ROM: 128GB/256GB UFS 3.1 (tidak ada slot microSD)\n- Layar: Dynamic AMOLED 2X FHD+ 6.2 inci, refresh rate 120Hz\n- Baterai: 4000mAh, Fast Charging 25W, Wireless Charging 15W\n- Kamera: Belakang 12MP (wide) + 64MP (telephoto) + 12MP (ultrawide), Depan 10MP\n- OS: Android 11, One UI 3.1\n- Jaringan: 5G, Wi-Fi 6, Bluetooth 5.0\n- Dimensi: 151.7 x 71.2 x 7.9 mm\n- Berat: 169 gram\n- Warna: Phantom Gray, Phantom White, Phantom Violet, Phantom Pink\n",
  "rumus luas lingkaran": "Rumus luas lingkaran adalah π × r × r (pi kali jari-jari kuadrat).",
  "rumus keliling lingkaran": "Rumus keliling lingkaran adalah 2 × π × r (dua kali pi kali jari-jari).",
  "rumus luas persegi": "Rumus luas persegi adalah sisi × sisi.",
  "rumus keliling persegi": "Rumus keliling persegi adalah 4 × sisi.",
  "rumus luas segitiga": "Rumus luas segitiga adalah 1/2 × alas × tinggi.",
  "rumus keliling segitiga": "Rumus keliling segitiga adalah jumlah semua sisinya.",
  "rumus luas persegi panjang": "Rumus luas persegi panjang adalah panjang × lebar.",
  "rumus keliling persegi panjang": "Rumus keliling persegi panjang adalah 2 × (panjang + lebar).",
  "siapa penemu lampu": "Penemu lampu pijar adalah Thomas Alva Edison.",
  "siapa penemu telepon": "Penemu telepon adalah Alexander Graham Bell.",
  "siapa penemu komputer": "Penemu komputer modern adalah Charles Babbage.",
  "siapa penemu pesawat": "Penemu pesawat terbang adalah Wright bersaudara (Orville dan Wilbur Wright).",
  "siapa penemu radio": "Penemu radio adalah Guglielmo Marconi.",
  "siapa penemu internet": "Internet dikembangkan oleh banyak ilmuwan, salah satunya Vint Cerf.",
  "apa itu internet": "Internet adalah jaringan komputer global yang saling terhubung.",
  "apa itu wifi": "WiFi adalah teknologi nirkabel untuk menghubungkan perangkat ke internet.",
  "apa itu cpu": "CPU (Central Processing Unit) adalah otak dari komputer yang memproses data.",
  "apa itu gpu": "GPU (Graphics Processing Unit) adalah prosesor khusus untuk grafis.",
  "apa itu ram": "RAM (Random Access Memory) adalah memori sementara untuk menyimpan data aplikasi yang sedang berjalan.",
  "apa itu ssd": "SSD (Solid State Drive) adalah media penyimpanan data yang lebih cepat dari HDD.",
  "apa itu cloud computing": "Cloud computing adalah layanan komputasi melalui internet (awan).",
  "apa itu ai": "AI (Artificial Intelligence) adalah kecerdasan buatan yang dibuat oleh manusia.",
  "apa itu chatbot": "Chatbot adalah program komputer yang bisa berinteraksi dengan manusia melalui teks atau suara.",
  "apa itu python": "Python adalah bahasa pemrograman yang mudah dipelajari dan banyak digunakan.",
  "apa itu html": "HTML (HyperText Markup Language) adalah bahasa markup untuk membuat halaman web.",
  "apa itu css": "CSS (Cascading Style Sheets) adalah bahasa untuk mengatur tampilan halaman web.",
  "apa itu javascript": "JavaScript adalah bahasa pemrograman untuk membuat halaman web interaktif.",
  "apa itu database": "Database adalah tempat untuk menyimpan dan mengelola data secara terstruktur.",
  "apa itu sqlite": "SQLite adalah sistem manajemen database ringan yang tidak memerlukan server terpisah.",
  "apa itu sql": "SQL (Structured Query Language) adalah bahasa untuk mengelola dan mengambil data dari database.",
  "apa itu api": "API (Application Programming Interface) adalah antarmuka untuk menghubungkan aplikasi satu dengan lainnya.",
  "apa itu gui": "GUI (Graphical User Interface) adalah antarmuka pengguna berbasis grafis.",
  "apa itu terminal": "Terminal adalah antarmuka berbasis teks untuk menjalankan perintah di komputer.",
  "apa itu pip": "pip adalah package manager untuk menginstal library Python.",
  "apa itu pygame": "Pygame adalah library Python untuk membuat game dan multimedia.",
  "apa itu tkinter": "Tkinter adalah library Python untuk membuat aplikasi GUI sederhana.",
  "apa itu github": "GitHub adalah platform untuk menyimpan dan berkolaborasi pada kode sumber secara online.",
  "apa itu open source": "Open source adalah perangkat lunak yang kode sumbernya terbuka untuk umum.",
  "apa itu windows": "Windows adalah sistem operasi buatan Microsoft.",
  "apa itu linux": "Linux adalah sistem operasi open source yang banyak digunakan di server dan komputer pribadi.",
  "apa itu android": "Android adalah sistem operasi untuk perangkat mobile berbasis Linux.",
  "apa itu ios": "iOS adalah sistem operasi untuk perangkat mobile buatan Apple.",
  "apa itu cloud": "Cloud adalah istilah untuk layanan komputasi berbasis internet.",
  "apa itu virus komputer": "Virus komputer adalah program berbahaya yang dapat menggandakan diri dan merusak sistem.",
  "apa itu enkripsi": "Enkripsi adalah proses mengubah data menjadi kode agar tidak bisa dibaca tanpa kunci khusus.",
  "apa itu sensor": "Sensor adalah alat untuk mendeteksi perubahan lingkungan fisik.",
  "apa itu iot": "IoT (Internet of Things) adalah konsep menghubungkan perangkat fisik ke internet.",
  "apa itu robot": "Robot adalah mesin yang dapat melakukan tugas secara otomatis.",
  "apa itu drone": "Drone adalah pesawat tanpa awak yang dikendalikan dari jarak jauh.",
  "apa itu cloud storage": "Cloud storage adalah layanan penyimpanan data secara online.",
  "apa itu email": "Email adalah surat elektronik yang dikirim melalui internet.",
  "apa itu browser": "Browser adalah aplikasi untuk mengakses dan menampilkan halaman web.",
  "apa itu url": "URL (Uniform Resource Locator) adalah alamat untuk mengakses sumber daya di internet.",
  "apa itu domain": "Domain adalah nama unik untuk mengidentifikasi alamat website.",
  "apa itu hosting": "Hosting adalah layanan untuk menyimpan data dan website agar bisa diakses melalui internet.",
  "apa itu server": "Server adalah komputer yang menyediakan layanan untuk komputer lain dalam jaringan.",
  "apa itu client": "Client adalah komputer atau aplikasi yang meminta layanan dari server.",
  "apa itu bandwidth": "Bandwidth adalah kapasitas maksimum data yang dapat dikirimkan melalui jaringan.",
  "apa itu modem": "Modem adalah perangkat untuk menghubungkan komputer ke internet.",
  "apa itu router": "Router adalah perangkat untuk menghubungkan beberapa jaringan komputer.",
  "apa itu bluetooth": "Bluetooth adalah teknologi nirkabel untuk menghubungkan perangkat dalam jarak dekat.",
  "apa itu sensor sidik jari": "Sensor sidik jari adalah alat untuk mengenali identitas berdasarkan pola sidik jari.",
  "apa itu face recognition": "Face recognition adalah teknologi untuk mengenali wajah seseorang.",
  "apa itu biometrik": "Biometrik adalah teknologi untuk mengenali identitas berdasarkan ciri fisik.",
  "apa itu resolusi layar": "Resolusi layar adalah jumlah piksel pada layar, misal 1920x1080.",
  "apa itu refresh rate": "Refresh rate adalah jumlah pembaruan gambar per detik pada layar (Hz).",
  "apa itu fps": "FPS (Frame Per Second) adalah jumlah frame yang ditampilkan per detik.",
  "apa itu gpu turbo": "GPU Turbo adalah teknologi untuk meningkatkan performa grafis pada perangkat mobile.",
  "apa itu fast charging": "Fast charging adalah teknologi pengisian daya baterai dengan cepat.",
  "apa itu wireless charging": "Wireless charging adalah pengisian daya baterai tanpa kabel.",
  "apa itu otg": "OTG (On-The-Go) adalah fitur untuk menghubungkan perangkat USB ke smartphone.",
  "apa itu hotspot": "Hotspot adalah fitur untuk membagikan koneksi internet ke perangkat lain.",
  "apa itu tethering": "Tethering adalah membagikan koneksi internet dari satu perangkat ke perangkat lain.",
  "apa itu airplane mode": "Airplane mode adalah mode untuk menonaktifkan sinyal radio pada perangkat.",
  "apa itu dark mode": "Dark mode adalah tampilan aplikasi dengan latar gelap.",
  "apa itu screenshot": "Screenshot adalah gambar tangkapan layar.",
  "apa itu screen recorder": "Screen recorder adalah aplikasi untuk merekam aktivitas layar.",
  "apa itu emulator": "Emulator adalah perangkat lunak untuk menjalankan aplikasi dari sistem lain.",
  "apa itu virtual machine": "Virtual machine adalah perangkat lunak untuk menjalankan sistem operasi lain di dalam komputer.",
  "apa itu bios": "BIOS adalah perangkat lunak dasar untuk mengatur perangkat keras komputer.",
  "apa itu uefi": "UEFI adalah penerus BIOS dengan fitur lebih modern.",
  "apa itu overclock": "Overclock adalah meningkatkan kecepatan kerja perangkat keras di atas standar.",
  "apa itu benchmark": "Benchmark adalah pengujian performa perangkat keras atau perangkat lunak.",
  "apa itu root": "Root adalah akses penuh ke sistem operasi Android.",
  "apa itu jailbreak": "Jailbreak adalah membuka akses penuh ke sistem operasi iOS.",
  "apa itu update": "Update adalah pembaruan perangkat lunak agar lebih aman dan fitur baru.",
  "apa itu downgrade": "Downgrade adalah menurunkan versi perangkat lunak.",
  "apa itu backup": "Backup adalah membuat salinan data untuk mencegah kehilangan.",
  "apa itu restore": "Restore adalah mengembalikan data dari backup.",
  "apa itu reset": "Reset adalah mengembalikan perangkat ke pengaturan awal.",
  "apa itu recovery mode": "Recovery mode adalah mode khusus untuk pemulihan sistem.",
  "apa itu safe mode": "Safe mode adalah mode aman untuk memperbaiki masalah pada sistem.",
  "apa itu bug": "Bug adalah kesalahan atau cacat dalam perangkat lunak.",
  "apa itu patch": "Patch adalah perbaikan untuk bug pada perangkat lunak.",
  "apa itu firmware": "Firmware adalah perangkat lunak yang tertanam di perangkat keras.",
  "apa itu kernel": "Kernel adalah inti dari sistem operasi.",
  "apa itu openai": "OpenAI adalah perusahaan riset AI yang mengembangkan ChatGPT.",
  "apa itu chatgpt": "ChatGPT adalah model AI untuk percakapan alami buatan OpenAI.",
  "apa itu copilot": "GitHub Copilot adalah asisten AI untuk membantu menulis kode.",
  "siapa penemu listrik": "Penemu listrik adalah Michael Faraday dan Benjamin Franklin.",
  "siapa penemu telegraph": "Penemu telegraf adalah Samuel Morse.",
  "siapa penemu lampu lalu lintas": "Lampu lalu lintas pertama ditemukan oleh J.P. Knight.",
  "siapa penemu pesawat telepon": "Alexander Graham Bell adalah penemu pesawat telepon.",
  "siapa penemu bola lampu": "Thomas Alva Edison adalah penemu bola lampu.",
  "siapa penemu pesawat jet": "Frank Whittle adalah penemu mesin jet.",
  "siapa penemu pesawat televisi": "John Logie Baird adalah penemu televisi.",
  "siapa penemu kamera": "Joseph Nicéphore Niépce adalah penemu kamera.",
  "siapa penemu mesin uap": "James Watt adalah penemu mesin uap.",
  "siapa penemu email": "Ray Tomlinson adalah penemu email.",
  "siapa penemu www": "Tim Berners-Lee adalah penemu World Wide Web (WWW).",
  "siapa penemu bluetooth": "Jaap Haartsen adalah penemu teknologi Bluetooth.",
  "siapa penemu wifi": "John O'Sullivan dan timnya adalah penemu WiFi.",
  "siapa penemu baterai": "Alessandro Volta adalah penemu baterai.",
  "siapa penemu printer": "Charles Babbage adalah pelopor mesin cetak komputer.",
  "siapa penemu mouse komputer": "Douglas Engelbart adalah penemu mouse komputer.",
  "siapa penemu flashdisk": "Dov Moran adalah penemu flashdisk.",
  "siapa penemu spreadsheet": "Dan Bricklin dan Bob Frankston adalah penemu spreadsheet.",
  "siapa penemu internet banking": "Internet banking dikembangkan oleh Stanford Federal Credit Union pada tahun 1994.",
  "siapa penemu ATM": "John Shepherd-Barron adalah penemu mesin ATM.",
  "apa itu deep learning": "Deep learning adalah cabang machine learning yang menggunakan jaringan saraf tiruan berlapis-lapis.",
  "apa itu machine learning": "Machine learning adalah cabang AI yang membuat komputer bisa belajar dari data.",
  "apa itu neural network": "Neural network adalah model komputasi yang terinspirasi dari jaringan saraf otak manusia.",
  "apa itu cloudflare": "Cloudflare adalah perusahaan yang menyediakan layanan keamanan dan CDN untuk website.",
  "apa itu docker": "Docker adalah platform untuk membuat, mengirim, dan menjalankan aplikasi dalam container.",
  "apa itu github actions": "GitHub Actions adalah layanan CI/CD dari GitHub untuk otomatisasi workflow.",
  "apa itu devops": "DevOps adalah praktik kolaborasi antara pengembang dan operasi untuk mempercepat pengembangan perangkat lunak.",
  "apa itu agile": "Agile adalah metode pengembangan perangkat lunak yang iteratif dan kolaboratif.",
  "apa itu scrum": "Scrum adalah kerangka kerja agile untuk mengelola proyek perangkat lunak.",
  "apa itu kanban": "Kanban adalah metode manajemen kerja visual untuk meningkatkan efisiensi.",
  "apa itu ci/cd": "CI/CD adalah praktik otomatisasi pengujian dan deployment perangkat lunak.",
  "apa itu responsive web design": "Responsive web design adalah teknik membuat tampilan web menyesuaikan ukuran layar perangkat.",
  "apa itu progressive web app": "Progressive Web App (PWA) adalah aplikasi web yang bisa diinstal seperti aplikasi native.",
  "apa itu microservices": "Microservices adalah arsitektur perangkat lunak yang membagi aplikasi menjadi layanan-layanan kecil.",
  "apa itu rest api": "REST API adalah antarmuka pemrograman aplikasi berbasis HTTP yang mengikuti prinsip REST.",
  "apa itu graphql": "GraphQL adalah query language untuk API yang dikembangkan oleh Facebook.",
  "apa itu json": "JSON (JavaScript Object Notation) adalah format data ringan untuk pertukaran data.",
  "apa itu yaml": "YAML adalah format data yang mudah dibaca manusia, sering digunakan untuk konfigurasi.",
  "apa itu dockerfile": "Dockerfile adalah file skrip untuk membangun image Docker.",
  "apa itu virtualenv": "Virtualenv adalah alat untuk membuat lingkungan Python terisolasi.",
  "apa itu pipenv": "Pipenv adalah alat manajemen dependensi dan virtual environment untuk Python.",
  "apa itu requirements.txt": "requirements.txt adalah file daftar dependensi Python untuk sebuah proyek.",
  "apa itu markdown": "Markdown adalah bahasa markup ringan untuk format teks.",
  "apa itu latex": "LaTeX adalah sistem typesetting untuk dokumen ilmiah dan matematika.",
  "apa itu ssh": "SSH (Secure Shell) adalah protokol untuk akses aman ke komputer jarak jauh.",
  "apa itu ssl": "SSL (Secure Sockets Layer) adalah protokol keamanan untuk komunikasi internet.",
  "apa itu tls": "TLS (Transport Layer Security) adalah penerus SSL untuk keamanan komunikasi data.",
  "apa itu captcha": "CAPTCHA adalah tes untuk membedakan manusia dan bot di internet.",
  "apa itu recaptcha": "reCAPTCHA adalah layanan CAPTCHA dari Google.",
  "apa itu two factor authentication": "Two Factor Authentication (2FA) adalah metode keamanan dengan dua lapisan verifikasi.",
  "apa itu biometric authentication": "Biometric authentication adalah metode verifikasi identitas menggunakan ciri fisik.",
  "apa itu blockchain": "Blockchain adalah teknologi penyimpanan data terdesentralisasi dan terenkripsi.",
  "apa itu cryptocurrency": "Cryptocurrency adalah mata uang digital yang menggunakan kriptografi.",
  "apa itu bitcoin": "Bitcoin adalah cryptocurrency pertama dan paling terkenal.",
  "apa itu ethereum": "Ethereum adalah platform blockchain dengan fitur smart contract.",
  "apa itu nft": "NFT (Non-Fungible Token) adalah aset digital unik di blockchain.",
  "apa itu metaverse": "Metaverse adalah dunia virtual yang dapat diakses melalui internet.",
  "apa itu ar": "AR (Augmented Reality) adalah teknologi yang menggabungkan dunia nyata dan virtual.",
  "apa itu vr": "VR (Virtual Reality) adalah teknologi yang membawa pengguna ke dunia virtual sepenuhnya.",
  "apa itu 5g": "5G adalah generasi kelima teknologi jaringan seluler dengan kecepatan tinggi.",
  "apa itu lte": "LTE (Long Term Evolution) adalah standar jaringan seluler generasi keempat (4G).",
  "apa itu nfc": "NFC (Near Field Communication) adalah teknologi komunikasi jarak dekat.",
  "apa itu qr code": "QR Code adalah kode dua dimensi yang dapat menyimpan data dan dibaca oleh kamera.",
  "apa itu barcode": "Barcode adalah kode batang yang menyimpan data dalam bentuk garis-garis.",
  "apa itu vpn": "VPN (Virtual Private Network) adalah layanan untuk mengamankan koneksi internet dan menyembunyikan identitas online.",
  "apa itu firewall": "Firewall adalah sistem keamanan jaringan untuk memantau dan mengontrol lalu lintas data.",
  "apa itu malware": "Malware adalah perangkat lunak berbahaya yang dapat merusak atau mencuri data.",
  "apa itu ransomware": "Ransomware adalah malware yang mengenkripsi data dan meminta tebusan.",
  "apa itu spyware": "Spyware adalah malware yang memata-matai aktivitas pengguna.",
  "apa itu phishing": "Phishing adalah upaya penipuan untuk mendapatkan data sensitif dengan menyamar sebagai pihak terpercaya.",
  "apa itu brute force": "Brute force adalah metode mencoba semua kemungkinan kombinasi password.",
  "apa itu ddos": "DDoS (Distributed Denial of Service) adalah serangan untuk melumpuhkan layanan online.",
  "apa itu social engineering": "Social engineering adalah teknik manipulasi psikologis untuk mendapatkan informasi rahasia.",
  "apa tujuan mu": "Tentu untuk membantu mu Akiro",
  "siapa pengembang mu": "Tentu kamu Akiro",
  "siapa pencipta mu": "Tentu kamu Akiro",
  "saya ingin belajar": "Bagus sekali! Apa yang ingin kamu pelajari? Aku bisa membantu dengan berbagai topik seperti pemrograman, matematika, sains, dan banyak lagi.",
  "saya ingin belajar pemrograman": "Bagus! Kamu bisa mulai dengan bahasa pemrograman seperti Python, JavaScript, atau Java. Ada banyak sumber daya online yang bisa membantu kamu belajar.",
  "apa itu java": "Java adalah bahasa pemrograman yang banyak digunakan untuk aplikasi desktop, web, dan mobile. Java terkenal karena portabilitasnya, artinya program yang ditulis di satu platform bisa dijalankan di platform lain tanpa perubahan.",
  "apa itu c++": "C++ adalah bahasa pemrograman yang merupakan pengembangan dari C. C++ mendukung pemrograman berorientasi objek dan banyak digunakan untuk pengembangan perangkat lunak, game, dan sistem operasi.",
  "apa itu c#": "C# (C Sharp) adalah bahasa pemrograman yang dikembangkan oleh Microsoft. C# banyak digunakan untuk pengembangan aplikasi desktop, web, dan game menggunakan platform .NET.",
  "apa itu array": "Array adalah struktur data yang menyimpan sekumpulan elemen dengan tipe data yang sama. Elemen-elemen dalam array diakses menggunakan indeks.",
  "apa itu linked list": "Linked list adalah struktur data yang terdiri dari node-node yang saling terhubung. Setiap node berisi data dan referensi ke node berikutnya. Linked list memungkinkan penambahan dan penghapusan elemen dengan efisien.",
  "apa itu stack": "Stack adalah struktur data yang mengikuti prinsip Last In First Out (LIFO). Elemen terakhir yang dimasukkan adalah yang pertama dikeluarkan. Stack sering digunakan dalam pemrograman untuk menyimpan status eksekusi.",
  "apa itu queue": "Queue adalah struktur data yang mengikuti prinsip First In First Out (FIFO). Elemen pertama yang dimasukkan adalah yang pertama dikeluarkan. Queue sering digunakan dalam antrian tugas atau proses.",
  "apa itu hash table": "Hash table adalah struktur data yang menyimpan pasangan kunci-nilai. Data diakses menggunakan kunci yang di-hash untuk menemukan lokasi penyimpanan yang efisien.",
  "apa itu binary tree": "Binary tree adalah struktur data pohon di mana setiap node memiliki paling banyak dua anak. Binary tree sering digunakan untuk menyimpan data terstruktur dan memungkinkan pencarian yang efisien.",
  "apa itu graph": "Graph adalah struktur data yang terdiri dari simpul (node) dan tepi (edge) yang menghubungkan simpul-simpul tersebut. Graph digunakan untuk merepresentasikan hubungan antar objek, seperti jaringan sosial atau peta.",
  "apa itu algorithm": "Algoritma adalah langkah-langkah terstruktur untuk menyelesaikan masalah atau tugas tertentu. Algoritma digunakan dalam pemrograman untuk mengolah data dan menghasilkan output yang diinginkan.",
  "apa itu sorting": "Sorting adalah proses mengurutkan data dalam urutan tertentu, seperti menaik atau menurun. Algoritma sorting yang umum digunakan antara lain Bubble Sort, Quick Sort, dan Merge Sort.",
  "bagaimana cara sorting": "Untuk melakukan sorting, kamu bisa menggunakan algoritma seperti Bubble Sort, Quick Sort, atau Merge Sort. Misalnya, untuk mengurutkan daftar angka dari yang terkecil ke terbesar, kamu bisa menggunakan Quick Sort yang efisien.",
  "Buble Sort": "Bubble Sort adalah algoritma sorting sederhana yang membandingkan setiap pasangan elemen dan menukarnya jika urutannya salah. Proses ini diulang hingga tidak ada lagi elemen yang perlu ditukar. Meskipun mudah dipahami, Bubble Sort tidak efisien untuk data besar.",
  "Quick Sort": "Quick Sort adalah algoritma sorting yang efisien dengan membagi data menjadi dua bagian berdasarkan pivot. Data di sebelah kiri pivot lebih kecil, sedangkan data di sebelah kanan lebih besar. Proses ini diulang secara rekursif hingga seluruh data terurut."
}